Plan:
```
# module.tech.module.clients.module.xxx.module.data.google_bigquery_table.xxx will be created
  + resource "google_bigquery_table" "xxx" {
      + creation_time       = (known after apply)
      + dataset_id          = "xxx"
      + etag                = (known after apply)
      + expiration_time     = (known after apply)
      + id                  = (known after apply)
      + last_modified_time  = (known after apply)
      + location            = (known after apply)
      + num_bytes           = (known after apply)
      + num_long_term_bytes = (known after apply)
      + num_rows            = (known after apply)
      + project             = "xxx"
      + schema              = jsonencode(
            [
              ...
            ]
        )
      + self_link           = (known after apply)
      + table_id            = "xxx"
      + type                = (known after apply)

      + external_data_configuration {
          + autodetect      = false
          + compression     = "NONE"
          + max_bad_records = 0
          + schema          = (known after apply)
          + source_format   = "CSV"
          + source_uris     = [
              + "gs://xxx/*",
            ]

          + csv_options {
              + allow_jagged_rows     = false
              + allow_quoted_newlines = true
              + encoding              = "UTF-8"
              + field_delimiter       = ","
              + quote                 = "\""
              + skip_leading_rows     = 1
            }

          + hive_partitioning_options {
              + mode              = "STRINGS"
              + source_uri_prefix = "gs://xxx/"
            }
        }
    }
```

Relevant bits from the apply:
```
2020/07/23 19:25:29 [WARN] Provider "registry.terraform.io/-/google" produced an invalid plan for module.tech.module.clients.module.xxx.module.data.google_bigquery_table.xxx, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .external_data_configuration[0].compression: planned value cty.StringVal("NONE") does not match config value cty.NullVal(cty.String)
      - .external_data_configuration[0].csv_options[0].allow_jagged_rows: planned value cty.False does not match config value cty.NullVal(cty.Bool)
      - .external_data_configuration[0].csv_options[0].encoding: planned value cty.StringVal("UTF-8") does not match config value cty.NullVal(cty.String)
module.tech.module.clients.module.xxx.module.data.google_bigquery_table.xxx: Creating...

2020/07/23 19:25:29 [DEBUG] module.tech.module.clients.module.xxx.module.data.google_bigquery_table.xxx: applying the planned Create change

2020/07/23 19:25:29 [WARN] Provider "registry.terraform.io/-/google" produced an unexpected new value for module.tech.module.clients.module.xxx.module.data.google_bigquery_table.xxx, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .description: was null, but now cty.StringVal("")
      - .friendly_name: was null, but now cty.StringVal("")
      - .external_data_configuration[0].ignore_unknown_values: was null, but now cty.False
module.tech.module.clients.module.xxx.module.data.google_bigquery_table.xxx: Creation complete after 1s [id=projects/xxx/datasets/xxx/tables/xxx]

```